package com.nc.autumn2020.tasks.lesson6;


/**
 * Создать URLHolder класс
 * Создать URLParameter класс
 * URLHolder должен уметь выводить на экран
 * Адрес сервера, Порт, Адрес идущий после адреса сервера, Параметры(ключ значение)
 * В качестве примера использовать адрес
 * Символы %3… должны быть раскодированы
 * URLHolder должен уметь собирать обратно строку в методе toString() в том виде в котором она пришла изначально (с учетом %3... символов),
 * http://localhost.netcracker.com:6810/product.plain_taskc.nc?tab=_Task&object=9090363151013783084&container=9158610804913819337&task=9158610813113819418&state=update&return=%2Fcommon%2Fuobject.jsp%3Fobject%3D9158610804913819337&object=9090363151013783084
 * Также нужно поискать в просторах интернета любой другой адрес и распарсить его
 * ** Используйте фабрику и метод newInstance() для URLHolder
 */
public class Task1 {
}
